tap "adoptopenjdk/openjdk"
tap "cantino/mcfly"
tap "caskroom/cask"
tap "clementtsang/bottom"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "mongodb/brew"
tap "shivammathur/php"
tap "zegervdv/zathura"
brew "openssl@1.1"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "gobject-introspection"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "ansible"
brew "antigen"
brew "arp-scan"
brew "libmpc"
brew "gcc"
brew "hwloc"
brew "autoconf"
brew "automake"
brew "autossh"
brew "bastet"
brew "bat"
brew "broot"
brew "browser"
brew "ccat"
brew "certbot"
brew "cheat"
brew "choose"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "cmocka"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "curlie"
brew "delta"
brew "deno"
brew "docker", link: false
brew "docker-compose"
brew "docker-machine"
brew "dog"
brew "dotnet", link: false
brew "duf"
brew "dust"
brew "libogg"
brew "libtool"
brew "netpbm"
brew "graphviz"
brew "libvorbis"
brew "gtk+3"
brew "qt"
brew "poppler"
brew "pulseaudio"
brew "efl"
brew "emacs"
brew "entr"
brew "eralchemy"
brew "ettercap"
brew "exa"
brew "fd"
brew "libass"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc@6"
brew "gh"
brew "git"
brew "git-lfs"
brew "libuv"
brew "gitmoji"
brew "glances"
brew "glew"
brew "glm"
brew "gnuplot"
brew "go"
brew "gping"
brew "gpp"
brew "gradle"
brew "grep"
brew "groff"
brew "gsl"
brew "gtk-mac-integration"
brew "hadolint"
brew "hashcat"
brew "highlight"
brew "hping"
brew "htop"
brew "hydra"
brew "hyperfine"
brew "id3tool"
brew "id3v2"
brew "python@3.8"
brew "imagemagick"
brew "iproute2mac"
brew "ipython", link: false
brew "jp2a"
brew "jq"
brew "pandoc"
brew "jupyterlab", link: false
brew "libconfig"
brew "lighttpd"
brew "lolcat"
brew "lsd"
brew "lynx"
brew "make"
brew "maven"
brew "ninja"
brew "meson"
brew "mp3info"
brew "mysql", restart_service: true
brew "nasm"
brew "ncrack"
brew "tree-sitter"
brew "neovim", link: false
brew "ninvaders"
brew "nmap"
brew "nsnake"
brew "portaudio"
brew "sip"
brew "tbb"
brew "octave"
brew "open-ocd"
brew "openjdk@11"
brew "openrtsp"
brew "openvpn"
brew "ossp-uuid"
brew "pacman4console"
brew "tree"
brew "pass"
brew "peco"
brew "php"
brew "pidof"
brew "pipenv"
brew "portmidi"
brew "postgresql"
brew "procs"
brew "proxychains-ng"
brew "pstree"
brew "putty"
brew "pv"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "rust"
brew "sbcl"
brew "sdl"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sdl_image"
brew "sdl_ttf"
brew "sendemail"
brew "sfml"
brew "shtool"
brew "sl"
brew "smpeg"
brew "sphinx-doc"
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmate"
brew "tmux"
brew "tor"
brew "trash"
brew "unison"
brew "vifm"
brew "w3m"
brew "watch"
brew "watchman"
brew "weechat"
brew "wemux"
brew "wget"
brew "xh"
brew "yarn"
brew "youtube-dl", link: false
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "cantino/mcfly/mcfly"
brew "clementtsang/bottom/bottom"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku", link: false
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "michaeleisel/zld/zld"
brew "mongodb/brew/mongocli"
brew "mongodb/brew/mongodb-community-shell"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "adoptopenjdk11"
cask "adoptopenjdk12"
cask "adoptopenjdk13"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "android-sdk"
cask "background-music"
cask "eloston-chromium"
cask "fing"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "hyper"
cask "hyperswitch"
cask "inkscape"
cask "iterm2"
cask "keycastr"
cask "kitty"
cask "ngrok"
cask "osxfuse"
cask "rectangle"
cask "skim"
cask "spectacle"
cask "terminology"
cask "virtualbox"
cask "wine-stable"
cask "wkhtmltopdf"
cask "xquartz"
