tap "adoptopenjdk/openjdk"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "michaeleisel/zld"
tap "zegervdv/zathura"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bastard Tetris
brew "bastet"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pipe HTML to a browser
brew "browser"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Unit testing framework for C
brew "cmocka"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# .NET Core
brew "dotnet"
# Generic library support script
brew "libtool"
# GNU Emacs text editor
brew "emacs"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Simple entity relation (ER) diagrams generation
brew "eralchemy"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@6", link: false
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript", link: false
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Platform built on V8 to build network applications
brew "node", link: false
# Emoji guide for your commit messages
brew "gitmoji"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw", args: ["HEAD"]
# C++ mathematics library for graphics software
brew "glm"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# General-purpose preprocessor with customizable syntax
brew "gpp"
# GNU grep, egrep and fgrep
brew "grep"
# GNU troff text-formatting system
brew "groff"
# Numerical library for C and C++
brew "gsl"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line oriented TCP/IP packet assembler/analyzer
brew "hping"
# Improved top (interactive process viewer)
brew "htop"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# ID3 editing tool
brew "id3tool"
# Command-line editor
brew "id3v2"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython", link: false
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Portable library for network traffic capture
brew "libpcap"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Rainbows and unicorns in your console!
brew "lolcat"
# Text-based web browser
brew "lynx"
# Fast and user friendly build system
brew "meson"
# Cross platform, open source .NET development framework
brew "mono", link: false
# MP3 technical info viewer and ID3 1.x tag editor
brew "mp3info"
# Open source relational database management system
brew "mysql", restart_service: true
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Network authentication cracking tool
brew "ncrack"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", link: false
# Space Invaders in the terminal
brew "ninvaders"
# Port scanning utility for large networks
brew "nmap"
# Classic snake game with textual interface
brew "nsnake"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Command-line RTSP client
brew "openrtsp"
# Pacman for console
brew "pacman4console"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Cross-platform library for real-time MIDI I/O
brew "portmidi"
# Hook preloader
brew "proxychains-ng"
# Sound system for POSIX OSes
brew "pulseaudio"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Steel Bank Common Lisp system
brew "sbcl"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Image file loading library
brew "sdl_image"
# Library for using TrueType fonts in SDL applications
brew "sdl_ttf"
# Multi-media library with bindings for multiple languages
brew "sfml"
# GNU's portable shell tool
brew "shtool"
# SDL MPEG Player Library
brew "smpeg"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool for OSX
brew "unison"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl", link: false
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
# The Dart SDK
brew "dart-lang/dart/dart"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku", link: false
# A faster version of ld, Apple's linker
brew "michaeleisel/zld/zld"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk12"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk13"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
cask "android-sdk"
cask "background-music"
cask "font-source-code-pro"
cask "hyperswitch"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF reader and note-taking application
cask "skim"
# Move and resize windows with ease
cask "spectacle"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Open-source version of the X.Org X Window System
cask "xquartz"
