tap "adoptopenjdk/openjdk"
tap "cantino/mcfly"
tap "clementtsang/bottom"
tap "cristianoliveira/tap"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "mongodb/brew"
tap "neovim/neovim"
tap "shivammathur/php"
tap "zegervdv/zathura"
brew "bzip2", link: false
brew "zlib", link: false
brew "glib"
brew "pkg-config"
brew "gobject-introspection"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "ansible"
brew "zsh"
brew "antigen"
brew "libtool"
brew "arp-scan"
brew "gcc"
brew "hwloc"
brew "autoconf"
brew "automake"
brew "autossh"
brew "bandwhich"
brew "bash-completion", link: false
brew "bastet"
brew "bat"
brew "bettercap"
brew "broot"
brew "browser"
brew "ccat"
brew "certbot"
brew "cheat"
brew "choose"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "cmocka"
brew "cocoapods"
brew "php"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cups"
brew "curlie"
brew "delta"
brew "deno"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "dog"
brew "dotnet"
brew "duf"
brew "dust"
brew "emacs"
brew "entr"
brew "xinput", link: false
brew "netpbm"
brew "graphviz"
brew "eralchemy"
brew "ethereum"
brew "gtk+3"
brew "ettercap"
brew "exa"
brew "fd"
brew "libogg"
brew "libvorbis"
brew "libass"
brew "openjdk"
brew "pulseaudio"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc@6"
brew "gdrive"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "libuv"
brew "node"
brew "gitmoji"
brew "glab"
brew "glances"
brew "glew"
brew "glm"
brew "gnuplot"
brew "go"
brew "gping"
brew "gpp"
brew "gradle"
brew "grep"
brew "grex"
brew "groff"
brew "gsl"
brew "hadolint"
brew "highlight"
brew "htop"
brew "http-server"
brew "httpd"
brew "libssh"
brew "mysql"
brew "hydra"
brew "hyperfine"
brew "id3tool"
brew "imagemagick"
brew "iproute2"
brew "iproute2mac"
brew "ipython"
brew "irssi"
brew "jp2a"
brew "jq"
brew "pandoc"
brew "jupyterlab"
brew "kubernetes-cli"
brew "openjdk@11"
brew "languagetool"
brew "lazydocker"
brew "libconfig"
brew "lighttpd"
brew "lolcat"
brew "lsd"
brew "lynx"
brew "make"
brew "maven"
brew "ninja"
brew "meson"
brew "minikube"
brew "monero"
brew "mp3info"
brew "nasm"
brew "ncrack"
brew "portaudio"
brew "ncspot"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "nushell"
brew "nvm"
brew "octave"
brew "open-ocd"
brew "openssl@3"
brew "openvpn"
brew "ossp-uuid"
brew "pacman4console"
brew "tree"
brew "pass"
brew "peco"
brew "phpmyadmin"
brew "pipenv"
brew "qt"
brew "poppler"
brew "portmidi"
brew "postgresql"
brew "procs"
brew "proxychains-ng"
brew "pstree"
brew "putty"
brew "pv"
brew "pyenv"
brew "python-tk@3.10"
brew "python@3.8"
brew "ranger"
brew "redis"
brew "rename", link: false
brew "ripgrep"
brew "rust"
brew "sbcl"
brew "sdl"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sdl_image"
brew "sdl_ttf"
brew "sfml"
brew "shtool"
brew "sip"
brew "sl"
brew "smpeg"
brew "sphinx-doc"
brew "spotify-tui"
brew "spotifyd"
brew "sqlmap"
brew "sshfs"
brew "sshtrix"
brew "subversion"
brew "tbb"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmate"
brew "tmux"
brew "tokei"
brew "tor"
brew "unison"
brew "vifm"
brew "w3m"
brew "wakeonlan"
brew "watch"
brew "watchman"
brew "weechat"
brew "wemux"
brew "wget"
brew "xh"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh-completions"
brew "cantino/mcfly/mcfly"
brew "cristianoliveira/tap/ergo"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku", link: false
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongocli"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community", link: false
brew "mongodb/brew/mongodb-community-shell"
brew "shivammathur/php/php@7.1"
brew "shivammathur/php/php@7.2"
brew "zegervdv/zathura/girara", args: ["HEAD"]
